Repository: josecolomina/MatLogBJJ
Catalog: lib/l10n/app_*.arb
Languages: es

source: Weekly Goal
es: Objetivo Semanal

source: sessions
es: sesiones

source: Recent Activity
es: Actividad Reciente

# profileTitle
source: My Profile
es: Mi Perfil

source: Current Belt
es: Tu Cinturón Actual

source: degree
es: grado

source: degrees
es: grados

source: Edit Progress
es: Editar Progreso

source: Belt
es: Cinturón

source: Stripes
es: Grados

source: Save Changes
es: Guardar Cambios

source: Notifications & Schedule
es: Notificaciones y Horarios

source: Training Days
es: Días de entrenamiento

# usualTime
source: Usual Class Time
es: Hora habitual de clase

source: Link Email
es: Vincular Correo

source: Secure Account
es: Asegurar Cuenta

source: Please login
es: Por favor inicia sesión

# matchResultQuestion
source: What was the result of the training?
es: ¿Cuál fue el resultado del entrenamiento?

# addedRivalMessage
source: {name} added to your rivals
es: {name} añadido a tus compañeros

# imageSelectionError
source: Error selecting image: {error}
es: Error al seleccionar imagen: {error}

source: Schedule updated
es: Horario actualizado

# profileUpdated
source: Profile updated successfully
es: Perfil actualizado correctamente

# updateError
source: Error updating: {error}
es: Error al actualizar: {error}

# accountSecured
source: Account secured successfully!
es: ¡Cuenta asegurada con éxito!

# linkButton
source: Link
es: Vincular

# trainingLogged
source: Training logged successfully!
es: ¡Entrenamiento registrado con éxito!

# rpeLabel
source: RPE (Intensity)
es: RPE (Intensidad)

# saveProgress
source: Save your progress
es: Guarda tu progreso

# linkAccountDesc
source: Link your account to an email to avoid losing data if you change devices.
es: Asocia tu cuenta a un correo electrónico para no perder tus datos si cambias de dispositivo.

# rivalsTitle
source: Training Partners
es: Compañeros de Entreno

# noRivals
source: No training partners yet.
es: Aún no tienes compañeros guardados.

# addRival
source: Add Partner
es: Añadir

# newRivalTitle
source: New Partner
es: Nuevo Compañero

# nameLabel
source: Name
es: Nombre

# saveLabel
source: Save
es: Guardar

# cancelLabel
source: Cancel
es: Cancelar

source: Match vs
es: Combate vs

# winLabel
source: Win
es: Victoria

# lossLabel
source: Loss
es: Derrota

# drawLabel
source: Draw
es: Empate

# techniqueLibraryTitle
source: Technique Library
es: Biblioteca Técnica

# noTechniques
source: No techniques learned yet.
es: No hay técnicas aprendidas aún.

# repetitionsLabel
source: Repetitions
es: Repeticiones

# levelLabel
source: Level
es: Nivel

# techniqueDetailTitle
source: Technique Detail
es: Detalle de Técnica

# notesLabel
source: Notes
es: Notas

source: Save Notes
es: Guardar Notas

# historyLabel
source: History
es: Historial

source: Session Type
es: Tipo de sesión

# durationLabel
source: Duration
es: Duración

source: Training Notes
es: Notas de entrenamiento

# settingsTitle
source: Settings
es: Ajustes

# accountSection
source: Account
es: Cuenta

source: Manage Subscription
es: Gestionar Suscripción

source: Sign Out
es: Cerrar Sesión

source: Delete Account
es: Eliminar Cuenta

# aboutSection
source: About
es: Acerca de

source: Privacy Policy
es: Política de Privacidad

source: Terms of Service
es: Términos de Servicio

# versionLabel
source: Version
es: Versión

# beltWhite
source: White Belt
es: Cinturón Blanco

# beltBlue
source: Blue Belt
es: Cinturón Azul

# beltPurple
source: Purple Belt
es: Cinturón Morado

# beltBrown
source: Brown Belt
es: Cinturón Marrón

# beltBlack
source: Black Belt
es: Cinturón Negro

# analyticsTitle
source: Analytics & Progress
es: Analytics & Progreso

# gameStyleTitle
source: Game Style
es: Estilo de Juego

# gameStyleExplanation
source: This chart shows your technical profile based on the techniques you practice. The larger the area in each category, the more techniques you master in that style.
es: Este gráfico muestra tu perfil técnico basado en las técnicas que practicas. Cuanto mayor sea el área en cada categoría, más técnicas dominas en ese estilo.

# trainingDistributionTitle
source: Training Distribution
es: Distribución de Entrenamiento

# trainingDistributionExplanation
source: Shows what percentage of your training is with Gi vs NoGi. Helps you see if you are balanced or focusing more on one modality.
es: Muestra qué porcentaje de tu entrenamiento es con Kimono (Gi) vs Sin Kimono (NoGi). Te ayuda a ver si estás equilibrado o si te enfocas más en una modalidad.

# matTimeTitle
source: Mat Time
es: Tiempo en el Tatami

# matTimeExplanation
source: This chart shows your accumulated training hours over time. The line always goes up, representing your total effort on the mat.
es: Este gráfico muestra tus horas acumuladas de entrenamiento a lo largo del tiempo. La línea siempre sube, representando tu esfuerzo total en el tatami.

# intensityTitle
source: Intensity (RPE)
es: Intensidad (RPE)

# intensityExplanation
source: Each point represents the intensity of a training session (RPE from 1 to 10). Green = light session, Orange = moderate, Red = very intense. Helps you avoid overtraining.
es: Cada punto representa la intensidad de una sesión de entrenamiento (RPE de 1 a 10). Verde = sesión suave, Naranja = moderada, Rojo = muy intensa. Te ayuda a evitar el sobreentrenamiento.

# topPositionsTitle
source: Technique Categories
es: Categorías de Técnicas

# topPositionsExplanation
source: Shows the categories where you have the most techniques registered (Guard, Passing, Submission, Defense, Takedowns). Defines which areas you focus on most.
es: Muestra las categorías donde tienes más técnicas registradas (Guardia, Pasaje, Sumisión, Defensa, Derribo). Define en qué áreas te enfocas más.

# weeklyConsistencyTitle
source: Weekly Consistency
es: Consistencia Semanal

# weeklyConsistencyExplanation
source: Shows which days of the week you train most frequently. Helps you identify your training routine.
es: Muestra qué días de la semana entrenas más frecuentemente. Te ayuda a identificar tu rutina de entrenamiento.
